# 정수를 입력을 받습니다.
# 입력 받은 문자열을 정수로 바꿉니다.

# 문자열로 변환


#######################################
# 방법1. 문자열을 사용하는 방법
# 방법2. 나머지를 사용하는 방법
#######################################

#######################################
# 방법1. 문자열을 사용하는 방법
#######################################
# 마지막 자리 숫자를 추출
#정수를 입력을 받습니다.
 정수 = input("정수를 입력하시오")
 
 
# 숫자로 변환하기

정수 = int(정수)

# 짝수 확인
if 정수%2 == 0 :
    print("짝수")
    

num = input("숫자를 입력합니다.")
num = int(num)

if num % 2 == 0 :
    print("짝수입니다.")
    
print("종료")
    
# 홀수 확인
if 정수 %2 == 1 : 
    print("홀수")

num = input("숫자를 입력합니다.")
num = int(num)

if num % 2 == 1 :
 print("홀수입니다.")
 
print("종료")

#######################################
# 방법2. 나머지를 사용하는 방법  #% 사용 
#입력의 마지막 글자를 추출 
마지막글자 = "3"
마지막글자 = int("3")


if 마지막글자 == 0 or 마지막글자 == 2 or 마지마글자 
print("짝수")



#######################################

# 짝수 조건

# 홀수 조건
